Report.tex
% Created 2023-02-27 Mon 19:44
% Intended LaTeX compiler: pdflatex
\documentclass[twocolumn]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{balance}
\usepackage{graphics}
\usepackage{txfonts}
\usepackage{times}
\usepackage{color}
\usepackage{textcomp}
\usepackage{booktabs}
\usepackage{todonotes}
\usepackage{float}
\usepackage{url}
\usepackage{titling}
\usepackage[pdftex]{hyperref}
\usepackage{sectsty}
\sectionfont{\Large}
\subsectionfont{\large}
\subsubsectionfont{\large}
\paragraphfont{\normalsize}
\setlength{\parindent}{0em}
\setlength{\parskip}{1em}
\setlength{\columnsep}{2em}
\setlength{\droptitle}{-10em}
\makeatletter
\def\url@leostyle{%
\@ifundefined{selectfont}{\def\UrlFont{\sf}}{\def\UrlFont{\small\bf\ttfamily}}}
\makeatother
\urlstyle{leo}
\author{Struan Robertson \\ BSc (Hons) Applied Computing}
\date{May 2023}
\title{Terrain Model Processing with Machine Learning}
\hypersetup{
 pdfauthor={Struan Robertson \\ BSc (Hons) Applied Computing},
 pdftitle={Terrain Model Processing with Machine Learning},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{abstract}

You cannot use an org-mode header here.
If you do, it trashes the table of contents for the apa6 document class.
That's why Abstract is bolded manually.

As you can see, I write my documents 1 sentence to a line.
This is because I keep these documents under version control.
A single English sentence is similar to a single line of code.
You wouldn't run lines of code together in a production codebase, so don't run sentences together in a VC'ed text document.

Latex and org-mode both interpret a single empty line as a paragraph break, so the fact that your source document is 1 sentence per line will not be visible to anybody other than you.
\end{abstract}

\section{Introduction}
\label{sec:org8354b9e}

This section should introduce the project. It should include an explanation of the problem and the objectives of the project. It is very important to give a clear description of what the project is actually intended to do, preferably in non-technical terms. The report as a whole should include a clear description of the lifecycle stages undertaken and must describe the use of appropriate tools to support the development process. It should give a full and accurate description of the work done and achievements made, together with complete software documentation. Every effort should be made to provide a professional, quality description of the work. Proofread carefully for grammatical, spelling and punctuation errors or inconsistencies BBC. The report should be formatted as a justified, double-column, single-spaced, 10pt Times New Roman font document using an appropriate word processing system such as Microsoft Word, OpenOffice Writer or \LaTeX{} and converted to a PDF file. The length of the report is likely to depend, for example, on the number of images included. As a guide, you should aim for about 20 pages, with 15 pages regarded as a lower limit and 35 as an upper limit. What is required is quality rather than quantity. The general layout of the report should follow this example document although the number of sections and their headings will vary from project to project. The report should be written in a formal style: it is neither a diary nor a magazine article. All pages should be numbered. All references should be cited in the main body of the report and a standard referencing format (such as IEEE or Harvard style) should be adopted Wilde. The report should demonstrate that the student has used appropriate tools to support the development process and that verification and validation have been applied at all stages.


\subsection{First Subsection}
\label{sec:org8e32a2b}

The subsections can hold various information. Use subsections to break up your document and make it easier to read.

You can include lists with bullet points:
\begin{itemize}
\item \emph{Item 1}
\item \textbf{Item 2}
\item Item 3
\item Item 4
\item Item 5
\end{itemize}

\section{Code Test}
\label{sec:org8ff5562}

\begin{verbatim}

                print("testfuck")

\end{verbatim}
\end{document}